---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.op_Inequality(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
source: html/11c245de-65a5-8498-c262-436d48c683a3.htm
---
# Autodesk.Revit.DB.WorksetId.op_Inequality Method

Determines whether these two WorksetIds are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	WorksetId first,
	WorksetId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.WorksetId`) - The first WorksetId.
- **second** (`Autodesk.Revit.DB.WorksetId`) - The second WorksetId.

## Returns
True if the WorksetIds are different; otherwise, false.